{
    "metadata": {
        "title": "স্প্ল্যাশ স্ক্রিন / ইসলামিক লার্নিং এপ এর জন্য গুরুত্বপূর্ণ আয়াত ও হাদিস",
        "description": "সংক্ষিপ্ত, উচ্চমূল্যবান ইসলামিক পাঠ যাতে আরবি, বাংলা অর্থ ও রেফারেন্স দেওয়া আছে।",
        "format": "JSON",
        "language": "ar-bn",
        "purpose": "শিক্ষা ও প্রেরণা"
    },
    "quran_verses": [
        {
            "id": 1,
            "arabic": "إِنَّنِي أَنَا اللَّهُ لَا إِلَٰهَ إِلَّا أَنَا فَاعْبُدْنِي وَأَقِمِ الصَّلَاةَ لِذِكْرِي",
            "bangla": "নিশ্চয়ই আমি আল্লাহ, আমি ছাড়া কোনো ইলাহ নেই। সুতরাং আমারই ইবাদত কর এবং আমার স্মরণে সালাত কায়েম কর।",
            "reference": "সূরা ত্বা-হা, ২০:১৪"
        },
        {
            "id": 2,
            "arabic": "وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ وَارْكَعُوا مَعَ الرَّاكِعِينَ",
            "bangla": "তোমরা সালাত কায়েম কর, জাকাত দাও এবং রুকুকারীদের সঙ্গে রুকু কর।",
            "reference": "সূরা আল-বাকারাহ, ২:৪৩"
        },
        {
            "id": 3,
            "arabic": "وَقَضَىٰ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ وَبِالْوَالِدَيْنِ إِحْسَانًا",
            "bangla": "তোমার রব আদেশ দিয়েছেন যে, তোমরা তাঁকে ছাড়া কারো ইবাদত করো না এবং পিতা-মাতার সাথে সদাচরণ করো।",
            "reference": "সূরা আল-ইসরা, ১৭:২৩"
        },
        {
            "id": 4,
            "arabic": "وَتَعَاوَنُوا عَلَى الْبِرِّ وَالتَّقْوَىٰ  وَلَا تَعَاوَنُوا عَلَى الْإِثْمِ وَالْعُدْوَانِ",
            "bangla": "তোমরা সৎকাজ ও তাকওয়ার বিষয়ে একে অপরকে সহযোগিতা কর এবং পাপ ও সীমালঙ্ঘনের ব্যাপারে সহযোগিতা করো না।",
            "reference": "সূরা আল-মায়িদাহ, ৫:২"
        },
        {
            "id": 5,
            "arabic": "يَا أَيُّهَا الَّذِينَ آمَنُوا اجْتَنِبُوا كَثِيرًا مِنَ الظَّنِّ إِنَّ بَعْضَ الظَّنِّ إِثْمٌ",
            "bangla": "হে ঈমানদারগণ! তোমরা অনেক ধারণা থেকে বেঁচে থাক, নিশ্চয় কিছু ধারণা গুনাহ।",
            "reference": "সূরা আল-হুজুরাত, ৪৯:১২"
        },
        {
            "id": 6,
            "arabic": "إِنَّ اللَّهَ لَا يُغَيِّرُ مَا بِقَوْمٍ حَتَّىٰ يُغَيِّرُوا مَا بِأَنْفُسِهِمْ",
            "bangla": "নিশ্চয়ই আল্লাহ কোনো সম্প্রদায়ের অবস্থা পরিবর্তন করেন না, যতক্ষণ না তারা নিজেরা নিজেদের অবস্থা পরিবর্তন করে।",
            "reference": "সূরা আর-রাদ, ১৩:১১"
        },
        {
            "id": 7,
            "arabic": "وَمَنْ يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مَخْرَجًا",
            "bangla": "যে আল্লাহকে ভয় করে, তিনি তার জন্য উত্তরণের পথ তৈরি করে দেন।",
            "reference": "সূরা আত-তালাক, ৬৫:২"
        }
    ],
    "hadiths": [
        {
            "id": 1,
            "arabic": "بُنِيَ الإِسْلاَمُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامِ الصَّلاَةِ، وَإِيتَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ، وَصَوْمِ رَمَضَانَ",
            "bangla": "ইসলাম গড়ে উঠেছে পাঁচটি ভিত্তির উপর: এই সাক্ষ্য দেওয়া যে, আল্লাহ ছাড়া কোনো ইলাহ নেই এবং মুহাম্মাদ (সা.) আল্লাহর রাসূল; সালাত কায়েম করা; জাকাত দেওয়া; হজ্জ করা এবং রমজানের সিয়াম পালন করা।",
            "reference": "সহীহ বুখারি, হাদিস নং ৮"
        },
        {
            "id": 2,
            "arabic": "اتَّقِ اللَّهِ حَيْثُمَا كُنْتَ، وَأَتْبِعِ السَّيِّئَةَ الْحَسَنَةَ تَمْحُهَا، وَخَالِقِ النَّاسَ بِخُلُقٍ حَسَنٍ",
            "bangla": "তুমি যেখানেই থাক না কেন আল্লাহকে ভয় কর। মন্দ কাজের পর ভালো কাজ কর, তা তা মিটিয়ে দেবে। আর মানুষের সাথে উত্তম আচরণ কর।",
            "reference": "জামে আত-তিরমিযী, হাদিস নং ১৯৮৭"
        },
        {
            "id": 3,
            "arabic": "إِنَّمَا الْأَعْمَالُ بِالنِّيَّاتِ",
            "bangla": "নিশ্চয় সকল কাজ নিয়তের উপর নির্ভরশীল।",
            "reference": "সহীহ বুখারি, হাদিস নং ১"
        },
        {
            "id": 4,
            "arabic": "مَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ فِي الدُّنْيَا وَالْآخِرَةِ",
            "bangla": "যে কোনো মুসলিমের দোষ গোপন রাখে, আল্লাহ দুনিয়া ও আখিরাতে তার দোষ গোপন রাখবেন।",
            "reference": "সহীহ মুসলিম, হাদিস নং ২৬৯৯"
        },
        {
            "id": 5,
            "arabic": "الدُّنْيَا سِجْنُ الْمُؤْمِنِ وَجَنَّةُ الْكَافِرِ",
            "bangla": "দুনিয়া মুমিনের জন্য কারাগার এবং কাফেরের জন্য জান্নাতস্বরূপ।",
            "reference": "সহীহ মুসলিম, হাদিস নং ২৯৫৬"
        },
        {
            "id": 6,
            "arabic": "الْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى",
            "bangla": "দানকারী হাত গ্রহণকারী হাতের চেয়ে উত্তম।",
            "reference": "সহীহ বুখারি, হাদিস নং ১৪২৯"
        },
        {
            "id": 7,
            "arabic": "مَنْ حَمَلَ عَلَيْنَا السِّلَاحَ فَلَيْسَ مِنَّا",
            "bangla": "যে আমাদের বিরুদ্ধে অস্ত্র ধারণ করে, সে আমাদের দলভুক্ত নয়।",
            "reference": "সহীহ বুখারি, হাদিস নং ৬৮৭৪"
        },
        {
            "id": 8,
            "arabic": "الْإِثْمُ مَا حَاكَ فِي صَدْرِكَ وَكَرِهْتَ أَنْ يَطَّلِعَ عَلَيْهِ النَّاسُ",
            "bangla": "পাপ হলো সেই জিনিস যা তোমার মনে কাঁটা হয়ে থাকে এবং তুমি অপছন্দ কর যে, মানুষ তা জানুক।",
            "reference": "সহীহ মুসলিম, হাদিস নং ২৫৫৩"
        },
        {
            "id": 9,
            "arabic": "لَا يَدْخُلُ الْجَنَّةَ مَنْ لَا يَأْمَنُ جَارُهُ بَوَائِقَهُ",
            "bangla": "যার অনিষ্ট থেকে তার প্রতিবেশী নিরাপদ নয়, সে জান্নাতে প্রবেশ করবে না।",
            "reference": "সহীহ বুখারি, হাদিস নং ৬০১৬"
        },
        {
            "id": 10,
            "arabic": "الْعَيْنَانِ تَزْنِيَانِ وَزِنَاهُمَا النَّظَرُ",
            "bangla": "দুটি চোখও ব্যভিচার করে, আর তাদের ব্যভিচার হলো (অবৈদ্ধ) দৃষ্টিপাত।",
            "reference": "সহীহ বুখারি, হাদিস নং ৬৬১২"
        },
        {
            "id": 11,
            "arabic": "إِيَّاكُمْ وَالْغُبْتَةَ، فَإِنَّ الْغِيبَةَ أَشَدُّ مِنَ الزِّنَا",
            "bangla": "পরনিন্দা থেকে বেঁচে থাক, কেননা পরনিন্দা ব্যভিচার থেকেও মারাত্মক।",
            "reference": "মুসনাদে আহমাদ, হাদিস নং ১৪১৯"
        },
        {
            "id": 12,
            "arabic": "الْمُسْلِمُ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ",
            "bangla": "প্রকৃত মুসলিম সেই, যার জিহ্বা ও হাত থেকে অন্য মুসলিম নিরাপদ থাকে।",
            "reference": "সহীহ বুখারি, হাদিস নং ১০"
        }
    ]
}